result_YF128GYMSM-T0_CCWDS_2406.txt
Seq1M-Read-Q8: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=8
Seq1M-Write-Q8: (g=1): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=8
Seq1M-Read: (g=2): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
Seq1M-Write: (g=3): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
Rand-Read-4K-Q32: (g=4): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
Rand-Write-4K-Q32: (g=5): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
Rand-Read-4K: (g=6): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
Rand-Write-4K: (g=7): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
fio-3.28
Starting 8 processes
3;fio-3.28;Seq1M-Read-Q8;0;0;1048576;87710;85;11955;350;24885;11625.195100;1360.833201;23045;97116;81538.534294;3430.754831;1.000000%=71827;5.000000%=80216;10.000000%=80216;20.000000%=80216;30.000000%=80216;40.000000%=80216;50.000000%=81264;60.000000%=82313;70.000000%=83361;80.000000%=83361;90.000000%=83361;95.000000%=84410;99.000000%=85458;99.500000%=90701;99.900000%=96993;99.950000%=96993;99.990000%=96993;0%=0;0%=0;0%=0;34407;109034;93166.867498;3609.419348;77792;90292;99.737177%;87479.478261;2677.054909;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.050192%;1.639619%;1025;0;2058;0.1%;0.2%;0.4%;99.3%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.29%;99.71%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;334775;105067;3;0;209806;159667;369473;99.54%
3;fio-3.28;Seq1M-Write-Q8;1;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;1048576;42428;41;24714;27;45476;24092.782950;14699.387760;11779;305865;168702.471270;96491.204187;1.000000%=82313;5.000000%=82313;10.000000%=82313;20.000000%=83361;30.000000%=91750;40.000000%=92798;50.000000%=95944;60.000000%=179306;70.000000%=278921;80.000000%=287309;90.000000%=304087;95.000000%=304087;99.000000%=304087;99.500000%=304087;99.900000%=304087;99.950000%=304087;99.990000%=304087;0%=0;0%=0;0%=0;23485;349350;192798.824089;109529.074264;22573;82084;98.901717%;41962.020408;22963.314374;0.720269%;0.619107%;1038;0;10;0.1%;0.2%;0.4%;99.3%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.10%;0.29%;55.86%;6.84%;36.91%;0.00%;0.00%;0.00%;0.00%;sdb;334775;105067;3;0;209806;159667;369473;99.54%
3;fio-3.28;Seq1M-Read;2;0;1048576;86402;84;12136;96;733;178.022275;23.003194;11362;13329;11653.470463;197.663570;1.000000%=11468;5.000000%=11468;10.000000%=11599;20.000000%=11599;30.000000%=11599;40.000000%=11599;50.000000%=11599;60.000000%=11599;70.000000%=11599;80.000000%=11599;90.000000%=11993;95.000000%=12124;99.000000%=12124;99.500000%=12779;99.900000%=12910;99.950000%=13303;99.990000%=13303;0%=0;0%=0;0%=0;11482;13517;11833.039304;205.442647;82084;88240;100.000000%;86450.304348;1685.584103;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.206016%;1.977750%;1034;0;267;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;100.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;334775;105067;3;0;209806;159667;369473;99.54%
3;fio-3.28;Seq1M-Write;3;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;1048576;38839;37;26998;135;367;251.261951;33.565115;11687;56499;26095.300608;14960.061335;1.000000%=11730;5.000000%=11862;10.000000%=11862;20.000000%=11862;30.000000%=12255;40.000000%=12255;50.000000%=12386;60.000000%=42729;70.000000%=43253;80.000000%=43253;90.000000%=43778;95.000000%=43778;99.000000%=44302;99.500000%=45350;99.900000%=54263;99.950000%=56360;99.990000%=56360;0%=0;0%=0;0%=0;11923;56789;26348.341724;14960.506679;22573;77979;99.236762%;38542.566038;19965.246568;0.607452%;0.655604%;1038;0;12;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;50.29%;49.51%;0.20%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;334775;105067;3;0;209806;159667;369473;99.54%
3;fio-3.28;Rand-Read-4K-Q32;4;0;695060;11584;2896;60001;8;2235;340.275044;18.742960;671;13186;10705.401869;219.409138;1.000000%=10420;5.000000%=10420;10.000000%=10420;20.000000%=10551;30.000000%=10551;40.000000%=10682;50.000000%=10682;60.000000%=10682;70.000000%=10813;80.000000%=10944;90.000000%=10944;95.000000%=11075;99.000000%=11337;99.500000%=11468;99.900000%=11862;99.950000%=11862;99.990000%=12517;0%=0;0%=0;0%=0;1011;13538;11046.415746;224.730887;11222;11832;100.000000%;11593.647059;167.653071;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;1.705000%;5.420000%;173790;0;41;0.1%;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.00%;0.01%;0.01%;0.01%;99.98%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;334775;105067;3;0;209806;159667;369473;99.54%
3;fio-3.28;Rand-Write-4K-Q32;5;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;213960;3565;891;60002;46;45445;1107.436123;1795.353438;1067;187319;34770.560592;16467.305926;1.000000%=30539;5.000000%=30801;10.000000%=30801;20.000000%=31064;30.000000%=31064;40.000000%=31064;50.000000%=31064;60.000000%=31326;70.000000%=31588;80.000000%=31850;90.000000%=32636;95.000000%=64749;99.000000%=95944;99.500000%=183500;99.900000%=185597;99.950000%=185597;99.990000%=187695;0%=0;0%=0;0%=0;2021;188407;35879.652089;16734.979611;2512;4008;100.000000%;3567.134454;400.366906;1.693305%;4.741588%;53554;0;11;0.1%;0.1%;0.1%;0.1%;0.1%;99.9%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.01%;0.01%;0.02%;93.35%;5.63%;0.99%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;334775;105067;3;0;209806;159667;369473;99.54%
3;fio-3.28;Rand-Read-4K;6;0;634696;10578;2644;60001;5;1708;16.219854;5.639057;2;1394;358.686012;21.221523;1.000000%=292;5.000000%=329;10.000000%=337;20.000000%=350;30.000000%=354;40.000000%=358;50.000000%=362;60.000000%=362;70.000000%=366;80.000000%=366;90.000000%=370;95.000000%=374;99.000000%=387;99.500000%=452;99.900000%=481;99.950000%=577;99.990000%=1089;0%=0;0%=0;0%=0;266;1710;375.314447;22.921371;10220;10752;100.000000%;10589.394958;151.683726;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;1.881667%;6.186667%;158720;0;12;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;99.92%;0.05%;0.01%;0.02%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;334775;105067;3;0;209806;159667;369473;99.54%
3;fio-3.28;Rand-Write-4K;7;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;198924;3315;828;60001;10;528;56.861981;4.271857;597;45183;1136.877853;1677.829621;1.000000%=921;5.000000%=929;10.000000%=937;20.000000%=1003;30.000000%=1011;40.000000%=1019;50.000000%=1036;60.000000%=1056;70.000000%=1073;80.000000%=1105;90.000000%=1122;95.000000%=1122;99.000000%=1384;99.500000%=1482;99.900000%=32636;99.950000%=33816;99.990000%=34865;0%=0;0%=0;0%=0;846;45240;1194.796866;1678.271534;2316;3624;100.000000%;3316.848739;390.140362;2.368333%;6.740000%;49775;0;10;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;15.95%;83.68%;0.01%;0.06%;0.01%;0.29%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;334775;105067;3;0;209806;159667;369473;99.54%

Seq1M-Read-Q8: (groupid=0, jobs=1): err= 0: pid=7294: Wed Jul 31 09:18:42 2024
  read: IOPS=85, BW=85.7MiB/s (89.8MB/s)(1024MiB/11955msec)
    slat (usec): min=350, max=24885, avg=11625.20, stdev=1360.83
    clat (usec): min=23045, max=97116, avg=81538.53, stdev=3430.75
     lat (msec): min=34, max=109, avg=93.17, stdev= 3.61
    clat percentiles (usec):
     |  1.00th=[71828],  5.00th=[80217], 10.00th=[80217], 20.00th=[80217],
     | 30.00th=[80217], 40.00th=[80217], 50.00th=[81265], 60.00th=[82314],
     | 70.00th=[83362], 80.00th=[83362], 90.00th=[83362], 95.00th=[84411],
     | 99.00th=[85459], 99.50th=[90702], 99.90th=[96994], 99.95th=[96994],
     | 99.99th=[96994]
   bw (  KiB/s): min=77792, max=90292, per=99.74%, avg=87479.48, stdev=2677.05, samples=23
   iops        : min=   75, max=   88, avg=85.26, stdev= 2.77, samples=23
  lat (msec)   : 50=0.29%, 100=99.71%
  cpu          : usr=0.05%, sys=1.64%, ctx=1025, majf=0, minf=2058
  IO depths    : 1=0.1%, 2=0.2%, 4=0.4%, 8=99.3%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1024,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
Seq1M-Write-Q8: (groupid=1, jobs=1): err= 0: pid=7299: Wed Jul 31 09:18:42 2024
  write: IOPS=41, BW=41.4MiB/s (43.4MB/s)(1024MiB/24714msec); 0 zone resets
    slat (usec): min=27, max=45476, avg=24092.78, stdev=14699.39
    clat (msec): min=11, max=305, avg=168.70, stdev=96.49
     lat (msec): min=23, max=349, avg=192.80, stdev=109.53
    clat percentiles (msec):
     |  1.00th=[   83],  5.00th=[   83], 10.00th=[   83], 20.00th=[   84],
     | 30.00th=[   92], 40.00th=[   93], 50.00th=[   96], 60.00th=[  180],
     | 70.00th=[  279], 80.00th=[  288], 90.00th=[  305], 95.00th=[  305],
     | 99.00th=[  305], 99.50th=[  305], 99.90th=[  305], 99.95th=[  305],
     | 99.99th=[  305]
   bw (  KiB/s): min=22573, max=82084, per=98.90%, avg=41962.02, stdev=22963.31, samples=49
   iops        : min=   22, max=   80, avg=40.90, stdev=22.37, samples=49
  lat (msec)   : 20=0.10%, 50=0.29%, 100=55.86%, 250=6.84%, 500=36.91%
  cpu          : usr=0.72%, sys=0.62%, ctx=1038, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.2%, 4=0.4%, 8=99.3%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1024,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
Seq1M-Read: (groupid=2, jobs=1): err= 0: pid=7303: Wed Jul 31 09:18:42 2024
  read: IOPS=84, BW=84.4MiB/s (88.5MB/s)(1024MiB/12136msec)
    slat (usec): min=96, max=733, avg=178.02, stdev=23.00
    clat (usec): min=11362, max=13329, avg=11653.47, stdev=197.66
     lat (usec): min=11482, max=13517, avg=11833.04, stdev=205.44
    clat percentiles (usec):
     |  1.00th=[11469],  5.00th=[11469], 10.00th=[11600], 20.00th=[11600],
     | 30.00th=[11600], 40.00th=[11600], 50.00th=[11600], 60.00th=[11600],
     | 70.00th=[11600], 80.00th=[11600], 90.00th=[11994], 95.00th=[12125],
     | 99.00th=[12125], 99.50th=[12780], 99.90th=[12911], 99.95th=[13304],
     | 99.99th=[13304]
   bw (  KiB/s): min=82084, max=88240, per=100.00%, avg=86450.30, stdev=1685.58, samples=23
   iops        : min=   80, max=   86, avg=84.26, stdev= 1.63, samples=23
  lat (msec)   : 20=100.00%
  cpu          : usr=0.21%, sys=1.98%, ctx=1034, majf=0, minf=267
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1024,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
Seq1M-Write: (groupid=3, jobs=1): err= 0: pid=7306: Wed Jul 31 09:18:42 2024
  write: IOPS=37, BW=37.9MiB/s (39.8MB/s)(1024MiB/26998msec); 0 zone resets
    slat (usec): min=135, max=367, avg=251.26, stdev=33.57
    clat (usec): min=11687, max=56499, avg=26095.30, stdev=14960.06
     lat (usec): min=11923, max=56789, avg=26348.34, stdev=14960.51
    clat percentiles (usec):
     |  1.00th=[11731],  5.00th=[11863], 10.00th=[11863], 20.00th=[11863],
     | 30.00th=[12256], 40.00th=[12256], 50.00th=[12387], 60.00th=[42730],
     | 70.00th=[43254], 80.00th=[43254], 90.00th=[43779], 95.00th=[43779],
     | 99.00th=[44303], 99.50th=[45351], 99.90th=[54264], 99.95th=[56361],
     | 99.99th=[56361]
   bw (  KiB/s): min=22573, max=77979, per=99.24%, avg=38542.57, stdev=19965.25, samples=53
   iops        : min=   22, max=   76, avg=37.57, stdev=19.46, samples=53
  lat (msec)   : 20=50.29%, 50=49.51%, 100=0.20%
  cpu          : usr=0.61%, sys=0.66%, ctx=1038, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1024,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
Rand-Read-4K-Q32: (groupid=4, jobs=1): err= 0: pid=7310: Wed Jul 31 09:18:42 2024
  read: IOPS=2896, BW=11.3MiB/s (11.9MB/s)(679MiB/60001msec)
    slat (usec): min=8, max=2235, avg=340.28, stdev=18.74
    clat (usec): min=671, max=13186, avg=10705.40, stdev=219.41
     lat (usec): min=1011, max=13538, avg=11046.42, stdev=224.73
    clat percentiles (usec):
     |  1.00th=[10421],  5.00th=[10421], 10.00th=[10421], 20.00th=[10552],
     | 30.00th=[10552], 40.00th=[10683], 50.00th=[10683], 60.00th=[10683],
     | 70.00th=[10814], 80.00th=[10945], 90.00th=[10945], 95.00th=[11076],
     | 99.00th=[11338], 99.50th=[11469], 99.90th=[11863], 99.95th=[11863],
     | 99.99th=[12518]
   bw (  KiB/s): min=11222, max=11832, per=100.00%, avg=11593.65, stdev=167.65, samples=119
   iops        : min= 2805, max= 2958, avg=2898.04, stdev=41.86, samples=119
  lat (usec)   : 750=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=99.98%
  cpu          : usr=1.71%, sys=5.42%, ctx=173790, majf=0, minf=41
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=173765,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
Rand-Write-4K-Q32: (groupid=5, jobs=1): err= 0: pid=7311: Wed Jul 31 09:18:42 2024
  write: IOPS=891, BW=3566KiB/s (3651kB/s)(209MiB/60002msec); 0 zone resets
    slat (usec): min=46, max=45445, avg=1107.44, stdev=1795.35
    clat (usec): min=1067, max=187319, avg=34770.56, stdev=16467.31
     lat (msec): min=2, max=188, avg=35.88, stdev=16.73
    clat percentiles (msec):
     |  1.00th=[   31],  5.00th=[   31], 10.00th=[   31], 20.00th=[   32],
     | 30.00th=[   32], 40.00th=[   32], 50.00th=[   32], 60.00th=[   32],
     | 70.00th=[   32], 80.00th=[   32], 90.00th=[   33], 95.00th=[   65],
     | 99.00th=[   96], 99.50th=[  184], 99.90th=[  186], 99.95th=[  186],
     | 99.99th=[  188]
   bw (  KiB/s): min= 2512, max= 4008, per=100.00%, avg=3567.13, stdev=400.37, samples=119
   iops        : min=  628, max= 1002, avg=891.44, stdev=100.02, samples=119
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.02%, 50=93.35%
  lat (msec)   : 100=5.63%, 250=0.99%
  cpu          : usr=1.69%, sys=4.74%, ctx=53554, majf=0, minf=11
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=99.9%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,53490,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
Rand-Read-4K: (groupid=6, jobs=1): err= 0: pid=7315: Wed Jul 31 09:18:42 2024
  read: IOPS=2644, BW=10.3MiB/s (10.8MB/s)(620MiB/60001msec)
    slat (usec): min=5, max=1708, avg=16.22, stdev= 5.64
    clat (usec): min=2, max=1394, avg=358.69, stdev=21.22
     lat (usec): min=266, max=1710, avg=375.31, stdev=22.92
    clat percentiles (usec):
     |  1.00th=[  293],  5.00th=[  330], 10.00th=[  338], 20.00th=[  351],
     | 30.00th=[  355], 40.00th=[  359], 50.00th=[  363], 60.00th=[  363],
     | 70.00th=[  367], 80.00th=[  367], 90.00th=[  371], 95.00th=[  375],
     | 99.00th=[  388], 99.50th=[  453], 99.90th=[  482], 99.95th=[  578],
     | 99.99th=[ 1090]
   bw (  KiB/s): min=10220, max=10752, per=100.00%, avg=10589.39, stdev=151.68, samples=119
   iops        : min= 2555, max= 2688, avg=2647.24, stdev=37.87, samples=119
  lat (usec)   : 4=0.01%, 500=99.92%, 750=0.05%, 1000=0.01%
  lat (msec)   : 2=0.02%
  cpu          : usr=1.88%, sys=6.19%, ctx=158720, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=158674,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
Rand-Write-4K: (groupid=7, jobs=1): err= 0: pid=7319: Wed Jul 31 09:18:42 2024
  write: IOPS=828, BW=3315KiB/s (3395kB/s)(194MiB/60001msec); 0 zone resets
    slat (usec): min=10, max=528, avg=56.86, stdev= 4.27
    clat (usec): min=597, max=45183, avg=1136.88, stdev=1677.83
     lat (usec): min=846, max=45240, avg=1194.80, stdev=1678.27
    clat percentiles (usec):
     |  1.00th=[  922],  5.00th=[  930], 10.00th=[  938], 20.00th=[ 1004],
     | 30.00th=[ 1012], 40.00th=[ 1020], 50.00th=[ 1037], 60.00th=[ 1057],
     | 70.00th=[ 1074], 80.00th=[ 1106], 90.00th=[ 1123], 95.00th=[ 1123],
     | 99.00th=[ 1385], 99.50th=[ 1483], 99.90th=[32637], 99.95th=[33817],
     | 99.99th=[34866]
   bw (  KiB/s): min= 2316, max= 3624, per=100.00%, avg=3316.85, stdev=390.14, samples=119
   iops        : min=  579, max=  906, avg=829.00, stdev=97.46, samples=119
  lat (usec)   : 750=0.01%, 1000=15.95%
  lat (msec)   : 2=83.68%, 4=0.01%, 10=0.06%, 20=0.01%, 50=0.29%
  cpu          : usr=2.37%, sys=6.74%, ctx=49775, majf=0, minf=10
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,49731,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=85.7MiB/s (89.8MB/s), 85.7MiB/s-85.7MiB/s (89.8MB/s-89.8MB/s), io=1024MiB (1074MB), run=11955-11955msec

Run status group 1 (all jobs):
  WRITE: bw=41.4MiB/s (43.4MB/s), 41.4MiB/s-41.4MiB/s (43.4MB/s-43.4MB/s), io=1024MiB (1074MB), run=24714-24714msec

Run status group 2 (all jobs):
   READ: bw=84.4MiB/s (88.5MB/s), 84.4MiB/s-84.4MiB/s (88.5MB/s-88.5MB/s), io=1024MiB (1074MB), run=12136-12136msec

Run status group 3 (all jobs):
  WRITE: bw=37.9MiB/s (39.8MB/s), 37.9MiB/s-37.9MiB/s (39.8MB/s-39.8MB/s), io=1024MiB (1074MB), run=26998-26998msec

Run status group 4 (all jobs):
   READ: bw=11.3MiB/s (11.9MB/s), 11.3MiB/s-11.3MiB/s (11.9MB/s-11.9MB/s), io=679MiB (712MB), run=60001-60001msec

Run status group 5 (all jobs):
  WRITE: bw=3566KiB/s (3651kB/s), 3566KiB/s-3566KiB/s (3651kB/s-3651kB/s), io=209MiB (219MB), run=60002-60002msec

Run status group 6 (all jobs):
   READ: bw=10.3MiB/s (10.8MB/s), 10.3MiB/s-10.3MiB/s (10.8MB/s-10.8MB/s), io=620MiB (650MB), run=60001-60001msec

Run status group 7 (all jobs):
  WRITE: bw=3315KiB/s (3395kB/s), 3315KiB/s-3315KiB/s (3395kB/s-3395kB/s), io=194MiB (204MB), run=60001-60001msec

Disk stats (read/write):
  sdb: ios=334775/105067, merge=3/0, ticks=209806/159667, in_queue=369473, util=99.54%